smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW21D5/MKW21D5_registers.h
/*
 * Constants & macros for individual CAU_DIRECT4 bitfields
 */

/*!
 * @name Register CAU_DIRECT4, field CAU_DIRECT4[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT4_CAU_DIRECT4 (0U)    /*!< Bit position for CAU_DIRECT4_CAU_DIRECT4. */
#define BM_CAU_DIRECT4_CAU_DIRECT4 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT4_CAU_DIRECT4. */
#define BS_CAU_DIRECT4_CAU_DIRECT4 (32U)   /*!< Bit field size in bits for CAU_DIRECT4_CAU_DIRECT4. */

/*! @brief Format value for bitfield CAU_DIRECT4_CAU_DIRECT4. */
#define BF_CAU_DIRECT4_CAU_DIRECT4(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT4_CAU_DIRECT4) & BM_CAU_DIRECT4_CAU_DIRECT4)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT5 - Direct access register 5
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT5 - Direct access register 5 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct5
{
    uint32_t U;
    struct _hw_cau_direct5_bitfields
    {
        uint32_t CAU_DIRECT5b : 32;    /*!< [31:0] Direct register 5 */
    } B;
} hw_cau_direct5_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT5 register
 */
/*@{*/
#define HW_CAU_DIRECT5_ADDR(x)   ((uintptr_t)(x) + 0x14U)

#define HW_CAU_DIRECT5(x)        (*(__O hw_cau_direct5_t *) HW_CAU_DIRECT5_ADDR(x))
#define HW_CAU_DIRECT5_WR(x, v)  (HW_CAU_DIRECT5(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT5 bitfields
 */

/*!
 * @name Register CAU_DIRECT5, field CAU_DIRECT5[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT5_CAU_DIRECT5 (0U)    /*!< Bit position for CAU_DIRECT5_CAU_DIRECT5. */
#define BM_CAU_DIRECT5_CAU_DIRECT5 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT5_CAU_DIRECT5. */
#define BS_CAU_DIRECT5_CAU_DIRECT5 (32U)   /*!< Bit field size in bits for CAU_DIRECT5_CAU_DIRECT5. */

/*! @brief Format value for bitfield CAU_DIRECT5_CAU_DIRECT5. */
#define BF_CAU_DIRECT5_CAU_DIRECT5(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT5_CAU_DIRECT5) & BM_CAU_DIRECT5_CAU_DIRECT5)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT6 - Direct access register 6
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT6 - Direct access register 6 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct6
{
    uint32_t U;
    struct _hw_cau_direct6_bitfields
    {
        uint32_t CAU_DIRECT6b : 32;    /*!< [31:0] Direct register 6 */
    } B;
} hw_cau_direct6_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT6 register
 */
/*@{*/
#define HW_CAU_DIRECT6_ADDR(x)   ((uintptr_t)(x) + 0x18U)

#define HW_CAU_DIRECT6(x)        (*(__O hw_cau_direct6_t *) HW_CAU_DIRECT6_ADDR(x))
#define HW_CAU_DIRECT6_WR(x, v)  (HW_CAU_DIRECT6(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT6 bitfields
 */

/*!
 * @name Register CAU_DIRECT6, field CAU_DIRECT6[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT6_CAU_DIRECT6 (0U)    /*!< Bit position for CAU_DIRECT6_CAU_DIRECT6. */
#define BM_CAU_DIRECT6_CAU_DIRECT6 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT6_CAU_DIRECT6. */
#define BS_CAU_DIRECT6_CAU_DIRECT6 (32U)   /*!< Bit field size in bits for CAU_DIRECT6_CAU_DIRECT6. */

/*! @brief Format value for bitfield CAU_DIRECT6_CAU_DIRECT6. */
#define BF_CAU_DIRECT6_CAU_DIRECT6(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT6_CAU_DIRECT6) & BM_CAU_DIRECT6_CAU_DIRECT6)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT7 - Direct access register 7
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT7 - Direct access register 7 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct7
{
    uint32_t U;
    struct _hw_cau_direct7_bitfields
    {
        uint32_t CAU_DIRECT7b : 32;    /*!< [31:0] Direct register 7 */
    } B;
} hw_cau_direct7_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT7 register
 */
/*@{*/
#define HW_CAU_DIRECT7_ADDR(x)   ((uintptr_t)(x) + 0x1CU)

#define HW_CAU_DIRECT7(x)        (*(__O hw_cau_direct7_t *) HW_CAU_DIRECT7_ADDR(x))
#define HW_CAU_DIRECT7_WR(x, v)  (HW_CAU_DIRECT7(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT7 bitfields
 */

/*!
 * @name Register CAU_DIRECT7, field CAU_DIRECT7[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT7_CAU_DIRECT7 (0U)    /*!< Bit position for CAU_DIRECT7_CAU_DIRECT7. */
#define BM_CAU_DIRECT7_CAU_DIRECT7 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT7_CAU_DIRECT7. */
#define BS_CAU_DIRECT7_CAU_DIRECT7 (32U)   /*!< Bit field size in bits for CAU_DIRECT7_CAU_DIRECT7. */

/*! @brief Format value for bitfield CAU_DIRECT7_CAU_DIRECT7. */
#define BF_CAU_DIRECT7_CAU_DIRECT7(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT7_CAU_DIRECT7) & BM_CAU_DIRECT7_CAU_DIRECT7)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT8 - Direct access register 8
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT8 - Direct access register 8 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct8
{
    uint32_t U;
    struct _hw_cau_direct8_bitfields
    {
        uint32_t CAU_DIRECT8b : 32;    /*!< [31:0] Direct register 8 */
    } B;
} hw_cau_direct8_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT8 register
 */
/*@{*/
#define HW_CAU_DIRECT8_ADDR(x)   ((uintptr_t)(x) + 0x20U)

#define HW_CAU_DIRECT8(x)        (*(__O hw_cau_direct8_t *) HW_CAU_DIRECT8_ADDR(x))
#define HW_CAU_DIRECT8_WR(x, v)  (HW_CAU_DIRECT8(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT8 bitfields
 */

/*!
 * @name Register CAU_DIRECT8, field CAU_DIRECT8[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT8_CAU_DIRECT8 (0U)    /*!< Bit position for CAU_DIRECT8_CAU_DIRECT8. */
#define BM_CAU_DIRECT8_CAU_DIRECT8 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT8_CAU_DIRECT8. */
#define BS_CAU_DIRECT8_CAU_DIRECT8 (32U)   /*!< Bit field size in bits for CAU_DIRECT8_CAU_DIRECT8. */

/*! @brief Format value for bitfield CAU_DIRECT8_CAU_DIRECT8. */
#define BF_CAU_DIRECT8_CAU_DIRECT8(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT8_CAU_DIRECT8) & BM_CAU_DIRECT8_CAU_DIRECT8)
/*@}*/

