smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW21D5/MKW21D5_registers.h
/*
 * Constants & macros for individual CAU_DIRECT13 bitfields
 */

/*!
 * @name Register CAU_DIRECT13, field CAU_DIRECT13[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT13_CAU_DIRECT13 (0U)  /*!< Bit position for CAU_DIRECT13_CAU_DIRECT13. */
#define BM_CAU_DIRECT13_CAU_DIRECT13 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT13_CAU_DIRECT13. */
#define BS_CAU_DIRECT13_CAU_DIRECT13 (32U) /*!< Bit field size in bits for CAU_DIRECT13_CAU_DIRECT13. */

/*! @brief Format value for bitfield CAU_DIRECT13_CAU_DIRECT13. */
#define BF_CAU_DIRECT13_CAU_DIRECT13(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT13_CAU_DIRECT13) & BM_CAU_DIRECT13_CAU_DIRECT13)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT14 - Direct access register 14
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT14 - Direct access register 14 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct14
{
    uint32_t U;
    struct _hw_cau_direct14_bitfields
    {
        uint32_t CAU_DIRECT14b : 32;   /*!< [31:0] Direct register 14 */
    } B;
} hw_cau_direct14_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT14 register
 */
/*@{*/
#define HW_CAU_DIRECT14_ADDR(x)  ((uintptr_t)(x) + 0x38U)

#define HW_CAU_DIRECT14(x)       (*(__O hw_cau_direct14_t *) HW_CAU_DIRECT14_ADDR(x))
#define HW_CAU_DIRECT14_WR(x, v) (HW_CAU_DIRECT14(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT14 bitfields
 */

/*!
 * @name Register CAU_DIRECT14, field CAU_DIRECT14[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT14_CAU_DIRECT14 (0U)  /*!< Bit position for CAU_DIRECT14_CAU_DIRECT14. */
#define BM_CAU_DIRECT14_CAU_DIRECT14 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT14_CAU_DIRECT14. */
#define BS_CAU_DIRECT14_CAU_DIRECT14 (32U) /*!< Bit field size in bits for CAU_DIRECT14_CAU_DIRECT14. */

/*! @brief Format value for bitfield CAU_DIRECT14_CAU_DIRECT14. */
#define BF_CAU_DIRECT14_CAU_DIRECT14(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT14_CAU_DIRECT14) & BM_CAU_DIRECT14_CAU_DIRECT14)
/*@}*/

/*******************************************************************************
 * HW_CAU_DIRECT15 - Direct access register 15
 ******************************************************************************/

/*!
 * @brief HW_CAU_DIRECT15 - Direct access register 15 (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_direct15
{
    uint32_t U;
    struct _hw_cau_direct15_bitfields
    {
        uint32_t CAU_DIRECT15b : 32;   /*!< [31:0] Direct register 15 */
    } B;
} hw_cau_direct15_t;

/*!
 * @name Constants and macros for entire CAU_DIRECT15 register
 */
/*@{*/
#define HW_CAU_DIRECT15_ADDR(x)  ((uintptr_t)(x) + 0x3CU)

#define HW_CAU_DIRECT15(x)       (*(__O hw_cau_direct15_t *) HW_CAU_DIRECT15_ADDR(x))
#define HW_CAU_DIRECT15_WR(x, v) (HW_CAU_DIRECT15(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_DIRECT15 bitfields
 */

/*!
 * @name Register CAU_DIRECT15, field CAU_DIRECT15[31:0] (WO)
 */
/*@{*/
#define BP_CAU_DIRECT15_CAU_DIRECT15 (0U)  /*!< Bit position for CAU_DIRECT15_CAU_DIRECT15. */
#define BM_CAU_DIRECT15_CAU_DIRECT15 (0xFFFFFFFFU) /*!< Bit mask for CAU_DIRECT15_CAU_DIRECT15. */
#define BS_CAU_DIRECT15_CAU_DIRECT15 (32U) /*!< Bit field size in bits for CAU_DIRECT15_CAU_DIRECT15. */

/*! @brief Format value for bitfield CAU_DIRECT15_CAU_DIRECT15. */
#define BF_CAU_DIRECT15_CAU_DIRECT15(v) ((uint32_t)((uint32_t)(v) << BP_CAU_DIRECT15_CAU_DIRECT15) & BM_CAU_DIRECT15_CAU_DIRECT15)
/*@}*/

/*******************************************************************************
 * HW_CAU_LDR_CASR - Status register  - Load Register command
 ******************************************************************************/

/*!
 * @brief HW_CAU_LDR_CASR - Status register  - Load Register command (WO)
 *
 * Reset value: 0x20000000U
 */
typedef union _hw_cau_ldr_casr
{
    uint32_t U;
    struct _hw_cau_ldr_casr_bitfields
    {
        uint32_t IC : 1;               /*!< [0]  */
        uint32_t DPE : 1;              /*!< [1]  */
        uint32_t RESERVED0 : 26;       /*!< [27:2]  */
        uint32_t VER : 4;              /*!< [31:28] CAU version */
    } B;
} hw_cau_ldr_casr_t;

/*!
 * @name Constants and macros for entire CAU_LDR_CASR register
 */
/*@{*/
#define HW_CAU_LDR_CASR_ADDR(x)  ((uintptr_t)(x) + 0x840U)

#define HW_CAU_LDR_CASR(x)       (*(__O hw_cau_ldr_casr_t *) HW_CAU_LDR_CASR_ADDR(x))
#define HW_CAU_LDR_CASR_WR(x, v) (HW_CAU_LDR_CASR(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_LDR_CASR bitfields
 */

/*!
 * @name Register CAU_LDR_CASR, field IC[0] (WO)
 *
 * Values:
 * - 0 - No illegal commands issued
 * - 1 - Illegal command issued
 */
/*@{*/
#define BP_CAU_LDR_CASR_IC   (0U)          /*!< Bit position for CAU_LDR_CASR_IC. */
#define BM_CAU_LDR_CASR_IC   (0x00000001U) /*!< Bit mask for CAU_LDR_CASR_IC. */
#define BS_CAU_LDR_CASR_IC   (1U)          /*!< Bit field size in bits for CAU_LDR_CASR_IC. */

/*! @brief Format value for bitfield CAU_LDR_CASR_IC. */
#define BF_CAU_LDR_CASR_IC(v) ((uint32_t)((uint32_t)(v) << BP_CAU_LDR_CASR_IC) & BM_CAU_LDR_CASR_IC)
/*@}*/

/*!
 * @name Register CAU_LDR_CASR, field DPE[1] (WO)
 *
 * Values:
 * - 0 - No error detected
 * - 1 - DES key parity error detected
 */
/*@{*/
#define BP_CAU_LDR_CASR_DPE  (1U)          /*!< Bit position for CAU_LDR_CASR_DPE. */
#define BM_CAU_LDR_CASR_DPE  (0x00000002U) /*!< Bit mask for CAU_LDR_CASR_DPE. */
#define BS_CAU_LDR_CASR_DPE  (1U)          /*!< Bit field size in bits for CAU_LDR_CASR_DPE. */

/*! @brief Format value for bitfield CAU_LDR_CASR_DPE. */
#define BF_CAU_LDR_CASR_DPE(v) ((uint32_t)((uint32_t)(v) << BP_CAU_LDR_CASR_DPE) & BM_CAU_LDR_CASR_DPE)
/*@}*/

/*!
 * @name Register CAU_LDR_CASR, field VER[31:28] (WO)
 *
 * Values:
 * - 0001 - Initial CAU version
 * - 0010 - Second version, added support for SHA-256 algorithm.(This is the
 *     value on this device)
 */
/*@{*/
#define BP_CAU_LDR_CASR_VER  (28U)         /*!< Bit position for CAU_LDR_CASR_VER. */
#define BM_CAU_LDR_CASR_VER  (0xF0000000U) /*!< Bit mask for CAU_LDR_CASR_VER. */
#define BS_CAU_LDR_CASR_VER  (4U)          /*!< Bit field size in bits for CAU_LDR_CASR_VER. */

