smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW21D5/MKW21D5_registers.h
/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW2SnL_data(x, n, v) (HW_FMC_DATAW2SnL_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * HW_FMC_DATAW3SnU - Cache Data Storage (upper word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW3SnU - Cache Data Storage (upper word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of 64-bit entries is a 4-way, set-associative cache with 2 sets.
 * The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSyU and
 * DATAWxSyL, x denotes the way, y denotes the set, and U and L represent upper and
 * lower word, respectively. This section represents data for the upper word (bits
 * [63:32]) of all sets in the indicated way.
 */
typedef union _hw_fmc_dataw3snu
{
    uint32_t U;
    struct _hw_fmc_dataw3snu_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [63:32] of data entry */
    } B;
} hw_fmc_dataw3snu_t;

/*!
 * @name Constants and macros for entire FMC_DATAW3SnU register
 */
/*@{*/
#define HW_FMC_DATAW3SnU_COUNT (2U)

#define HW_FMC_DATAW3SnU_ADDR(x, n) ((uintptr_t)(x) + 0x230U + (0x8U * (n)))

#define HW_FMC_DATAW3SnU(x, n)   (*(__IO hw_fmc_dataw3snu_t *) HW_FMC_DATAW3SnU_ADDR(x, n))
#define HW_FMC_DATAW3SnU_RD(x, n) (HW_FMC_DATAW3SnU(x, n).U)
#define HW_FMC_DATAW3SnU_WR(x, n, v) (HW_FMC_DATAW3SnU(x, n).U = (v))
#define HW_FMC_DATAW3SnU_SET(x, n, v) (HW_FMC_DATAW3SnU_WR(x, n, HW_FMC_DATAW3SnU_RD(x, n) |  (v)))
#define HW_FMC_DATAW3SnU_CLR(x, n, v) (HW_FMC_DATAW3SnU_WR(x, n, HW_FMC_DATAW3SnU_RD(x, n) & ~(v)))
#define HW_FMC_DATAW3SnU_TOG(x, n, v) (HW_FMC_DATAW3SnU_WR(x, n, HW_FMC_DATAW3SnU_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW3SnU bitfields
 */

/*!
 * @name Register FMC_DATAW3SnU, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW3SnU_data (0U)         /*!< Bit position for FMC_DATAW3SnU_data. */
#define BM_FMC_DATAW3SnU_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW3SnU_data. */
#define BS_FMC_DATAW3SnU_data (32U)        /*!< Bit field size in bits for FMC_DATAW3SnU_data. */

/*! @brief Read current value of the FMC_DATAW3SnU_data field. */
#define BR_FMC_DATAW3SnU_data(x, n) (HW_FMC_DATAW3SnU(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW3SnU_data. */
#define BF_FMC_DATAW3SnU_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW3SnU_data) & BM_FMC_DATAW3SnU_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW3SnU_data(x, n, v) (HW_FMC_DATAW3SnU_WR(x, n, v))
/*@}*/
/*******************************************************************************
 * HW_FMC_DATAW3SnL - Cache Data Storage (lower word)
 ******************************************************************************/

/*!
 * @brief HW_FMC_DATAW3SnL - Cache Data Storage (lower word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of 64-bit entries is a 4-way, set-associative cache with 2 sets.
 * The ways are numbered 0-3 and the sets are numbered 0-1. In DATAWxSyU and
 * DATAWxSyL, x denotes the way, y denotes the set, and U and L represent upper and
 * lower word, respectively. This section represents data for the lower word (bits
 * [31:0]) of all sets in the indicated way.
 */
typedef union _hw_fmc_dataw3snl
{
    uint32_t U;
    struct _hw_fmc_dataw3snl_bitfields
    {
        uint32_t data : 32;            /*!< [31:0] Bits [31:0] of data entry */
    } B;
} hw_fmc_dataw3snl_t;

/*!
 * @name Constants and macros for entire FMC_DATAW3SnL register
 */
/*@{*/
#define HW_FMC_DATAW3SnL_COUNT (2U)

#define HW_FMC_DATAW3SnL_ADDR(x, n) ((uintptr_t)(x) + 0x234U + (0x8U * (n)))

#define HW_FMC_DATAW3SnL(x, n)   (*(__IO hw_fmc_dataw3snl_t *) HW_FMC_DATAW3SnL_ADDR(x, n))
#define HW_FMC_DATAW3SnL_RD(x, n) (HW_FMC_DATAW3SnL(x, n).U)
#define HW_FMC_DATAW3SnL_WR(x, n, v) (HW_FMC_DATAW3SnL(x, n).U = (v))
#define HW_FMC_DATAW3SnL_SET(x, n, v) (HW_FMC_DATAW3SnL_WR(x, n, HW_FMC_DATAW3SnL_RD(x, n) |  (v)))
#define HW_FMC_DATAW3SnL_CLR(x, n, v) (HW_FMC_DATAW3SnL_WR(x, n, HW_FMC_DATAW3SnL_RD(x, n) & ~(v)))
#define HW_FMC_DATAW3SnL_TOG(x, n, v) (HW_FMC_DATAW3SnL_WR(x, n, HW_FMC_DATAW3SnL_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FMC_DATAW3SnL bitfields
 */

/*!
 * @name Register FMC_DATAW3SnL, field data[31:0] (RW)
 */
/*@{*/
#define BP_FMC_DATAW3SnL_data (0U)         /*!< Bit position for FMC_DATAW3SnL_data. */
#define BM_FMC_DATAW3SnL_data (0xFFFFFFFFU) /*!< Bit mask for FMC_DATAW3SnL_data. */
#define BS_FMC_DATAW3SnL_data (32U)        /*!< Bit field size in bits for FMC_DATAW3SnL_data. */

/*! @brief Read current value of the FMC_DATAW3SnL_data field. */
#define BR_FMC_DATAW3SnL_data(x, n) (HW_FMC_DATAW3SnL(x, n).U)

/*! @brief Format value for bitfield FMC_DATAW3SnL_data. */
#define BF_FMC_DATAW3SnL_data(v) ((uint32_t)((uint32_t)(v) << BP_FMC_DATAW3SnL_data) & BM_FMC_DATAW3SnL_data)

/*! @brief Set the data field to a new value. */
#define BW_FMC_DATAW3SnL_data(x, n, v) (HW_FMC_DATAW3SnL_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * hw_fmc_t - module struct
 ******************************************************************************/
/*!
 * @brief All FMC module registers.
 */
#pragma pack(1)
typedef struct _hw_fmc
{
    __IO hw_fmc_pfapr_t PFAPR;             /*!< [0x0] Flash Access Protection Register */
    __IO hw_fmc_pfb0cr_t PFB0CR;           /*!< [0x4] Flash Bank 0 Control Register */
    __IO hw_fmc_pfb1cr_t PFB1CR;           /*!< [0x8] Flash Bank 1 Control Register */
    uint8_t _reserved0[244];
    __IO hw_fmc_tagvdw0sn_t TAGVDW0Sn[2];  /*!< [0x100] Cache Tag Storage */
    __IO hw_fmc_tagvdw1sn_t TAGVDW1Sn[2];  /*!< [0x108] Cache Tag Storage */
    __IO hw_fmc_tagvdw2sn_t TAGVDW2Sn[2];  /*!< [0x110] Cache Tag Storage */
    __IO hw_fmc_tagvdw3sn_t TAGVDW3Sn[2];  /*!< [0x118] Cache Tag Storage */
    uint8_t _reserved1[224];
    struct {
        __IO hw_fmc_dataw0snu_t DATAW0SnU; /*!< [0x200] Cache Data Storage (upper word) */
        __IO hw_fmc_dataw0snl_t DATAW0SnL; /*!< [0x204] Cache Data Storage (lower word) */
    } DATAW0Sn[2];
    struct {
        __IO hw_fmc_dataw1snu_t DATAW1SnU; /*!< [0x210] Cache Data Storage (upper word) */
        __IO hw_fmc_dataw1snl_t DATAW1SnL; /*!< [0x214] Cache Data Storage (lower word) */
    } DATAW1Sn[2];
    struct {
        __IO hw_fmc_dataw2snu_t DATAW2SnU; /*!< [0x220] Cache Data Storage (upper word) */
        __IO hw_fmc_dataw2snl_t DATAW2SnL; /*!< [0x224] Cache Data Storage (lower word) */
    } DATAW2Sn[2];
    struct {
        __IO hw_fmc_dataw3snu_t DATAW3SnU; /*!< [0x230] Cache Data Storage (upper word) */
        __IO hw_fmc_dataw3snl_t DATAW3SnL; /*!< [0x234] Cache Data Storage (lower word) */
    } DATAW3Sn[2];
} hw_fmc_t;
#pragma pack()

