smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW21D5/MKW21D5_registers.h
#define HW_FTFL_FPROT1(x)        (*(__IO hw_ftfl_fprot1_t *) HW_FTFL_FPROT1_ADDR(x))
#define HW_FTFL_FPROT1_RD(x)     (HW_FTFL_FPROT1(x).U)
#define HW_FTFL_FPROT1_WR(x, v)  (HW_FTFL_FPROT1(x).U = (v))
#define HW_FTFL_FPROT1_SET(x, v) (HW_FTFL_FPROT1_WR(x, HW_FTFL_FPROT1_RD(x) |  (v)))
#define HW_FTFL_FPROT1_CLR(x, v) (HW_FTFL_FPROT1_WR(x, HW_FTFL_FPROT1_RD(x) & ~(v)))
#define HW_FTFL_FPROT1_TOG(x, v) (HW_FTFL_FPROT1_WR(x, HW_FTFL_FPROT1_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FPROT1 bitfields
 */

/*!
 * @name Register FTFL_FPROT1, field PROT[7:0] (RW)
 *
 * Each program flash region can be protected from program and erase operations
 * by setting the associated PROT bit. In NVM Normal mode: The protection can
 * only be increased, meaning that currently unprotected memory can be protected,
 * but currently protected memory cannot be unprotected. Since unprotected regions
 * are marked with a 1 and protected regions use a 0, only writes changing 1s to
 * 0s are accepted. This 1-to-0 transition check is performed on a bit-by-bit
 * basis. Those FPROT bits with 1-to-0 transitions are accepted while all bits with
 * 0-to-1 transitions are ignored. In NVM Special mode: All bits of FPROT are
 * writable without restriction. Unprotected areas can be protected and protected
 * areas can be unprotected. The user must never write to any FPROT register while
 * a command is running (CCIF=0). Trying to alter data in any protected area in
 * the program flash memory results in a protection violation error and sets the
 * FSTAT[FPVIOL] bit. A full block erase of a program flash block is not possible
 * if it contains any protected region. Each bit in the 32-bit protection
 * register represents 1/32 of the total program flash.
 *
 * Values:
 * - 0 - Program flash region is protected.
 * - 1 - Program flash region is not protected
 */
/*@{*/
#define BP_FTFL_FPROT1_PROT  (0U)          /*!< Bit position for FTFL_FPROT1_PROT. */
#define BM_FTFL_FPROT1_PROT  (0xFFU)       /*!< Bit mask for FTFL_FPROT1_PROT. */
#define BS_FTFL_FPROT1_PROT  (8U)          /*!< Bit field size in bits for FTFL_FPROT1_PROT. */

/*! @brief Read current value of the FTFL_FPROT1_PROT field. */
#define BR_FTFL_FPROT1_PROT(x) (HW_FTFL_FPROT1(x).U)

/*! @brief Format value for bitfield FTFL_FPROT1_PROT. */
#define BF_FTFL_FPROT1_PROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FPROT1_PROT) & BM_FTFL_FPROT1_PROT)

/*! @brief Set the PROT field to a new value. */
#define BW_FTFL_FPROT1_PROT(x, v) (HW_FTFL_FPROT1_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_FTFL_FPROT0 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief HW_FTFL_FPROT0 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any flash command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory . The bitfields are
 * defined in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8]
 * FPROT3 PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration
 * Field as indicated in the following table. Program flash protection register
 * Flash Configuration Field offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009
 * FPROT3 0x0008 To change the program flash protection that is loaded during
 * the reset sequence, unprotect the sector of program flash memory that contains
 * the Flash Configuration Field. Then, reprogram the program flash protection
 * byte.
 */
typedef union _hw_ftfl_fprot0
{
    uint8_t U;
    struct _hw_ftfl_fprot0_bitfields
    {
        uint8_t PROT : 8;              /*!< [7:0] Program Flash Region Protect */
    } B;
} hw_ftfl_fprot0_t;

/*!
 * @name Constants and macros for entire FTFL_FPROT0 register
 */
/*@{*/
#define HW_FTFL_FPROT0_ADDR(x)   ((uintptr_t)(x) + 0x13U)

#define HW_FTFL_FPROT0(x)        (*(__IO hw_ftfl_fprot0_t *) HW_FTFL_FPROT0_ADDR(x))
#define HW_FTFL_FPROT0_RD(x)     (HW_FTFL_FPROT0(x).U)
#define HW_FTFL_FPROT0_WR(x, v)  (HW_FTFL_FPROT0(x).U = (v))
#define HW_FTFL_FPROT0_SET(x, v) (HW_FTFL_FPROT0_WR(x, HW_FTFL_FPROT0_RD(x) |  (v)))
#define HW_FTFL_FPROT0_CLR(x, v) (HW_FTFL_FPROT0_WR(x, HW_FTFL_FPROT0_RD(x) & ~(v)))
#define HW_FTFL_FPROT0_TOG(x, v) (HW_FTFL_FPROT0_WR(x, HW_FTFL_FPROT0_RD(x) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FPROT0 bitfields
 */

/*!
 * @name Register FTFL_FPROT0, field PROT[7:0] (RW)
 *
 * Each program flash region can be protected from program and erase operations
 * by setting the associated PROT bit. In NVM Normal mode: The protection can
 * only be increased, meaning that currently unprotected memory can be protected,
 * but currently protected memory cannot be unprotected. Since unprotected regions
 * are marked with a 1 and protected regions use a 0, only writes changing 1s to
 * 0s are accepted. This 1-to-0 transition check is performed on a bit-by-bit
 * basis. Those FPROT bits with 1-to-0 transitions are accepted while all bits with
 * 0-to-1 transitions are ignored. In NVM Special mode: All bits of FPROT are
 * writable without restriction. Unprotected areas can be protected and protected
 * areas can be unprotected. The user must never write to any FPROT register while
 * a command is running (CCIF=0). Trying to alter data in any protected area in
 * the program flash memory results in a protection violation error and sets the
 * FSTAT[FPVIOL] bit. A full block erase of a program flash block is not possible
 * if it contains any protected region. Each bit in the 32-bit protection
 * register represents 1/32 of the total program flash.
 *
 * Values:
 * - 0 - Program flash region is protected.
 * - 1 - Program flash region is not protected
 */
/*@{*/
#define BP_FTFL_FPROT0_PROT  (0U)          /*!< Bit position for FTFL_FPROT0_PROT. */
#define BM_FTFL_FPROT0_PROT  (0xFFU)       /*!< Bit mask for FTFL_FPROT0_PROT. */
#define BS_FTFL_FPROT0_PROT  (8U)          /*!< Bit field size in bits for FTFL_FPROT0_PROT. */

/*! @brief Read current value of the FTFL_FPROT0_PROT field. */
#define BR_FTFL_FPROT0_PROT(x) (HW_FTFL_FPROT0(x).U)

/*! @brief Format value for bitfield FTFL_FPROT0_PROT. */
#define BF_FTFL_FPROT0_PROT(v) ((uint8_t)((uint8_t)(v) << BP_FTFL_FPROT0_PROT) & BM_FTFL_FPROT0_PROT)

/*! @brief Set the PROT field to a new value. */
#define BW_FTFL_FPROT0_PROT(x, v) (HW_FTFL_FPROT0_WR(x, v))
/*@}*/

