smachin1000/thread_nxp/FSL_Thread_Stack_0.6.0/KSDK/platform/CMSIS/Include/device/MKW21D5/MKW21D5_registers.h
/*! @brief Format value for bitfield RTC_WAR_LRW. */
#define BF_RTC_WAR_LRW(v)    ((uint32_t)((uint32_t)(v) << BP_RTC_WAR_LRW) & BM_RTC_WAR_LRW)

/*! @brief Set the LRW field to a new value. */
#define BW_RTC_WAR_LRW(x, v) (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_LRW) = (v))
/*@}*/

/*!
 * @name Register RTC_WAR, field IERW[7] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by software reset.
 *
 * Values:
 * - 0 - Writes to the Interupt Enable Register are ignored.
 * - 1 - Writes to the Interrupt Enable Register complete as normal.
 */
/*@{*/
#define BP_RTC_WAR_IERW      (7U)          /*!< Bit position for RTC_WAR_IERW. */
#define BM_RTC_WAR_IERW      (0x00000080U) /*!< Bit mask for RTC_WAR_IERW. */
#define BS_RTC_WAR_IERW      (1U)          /*!< Bit field size in bits for RTC_WAR_IERW. */

/*! @brief Read current value of the RTC_WAR_IERW field. */
#define BR_RTC_WAR_IERW(x)   (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_IERW))

/*! @brief Format value for bitfield RTC_WAR_IERW. */
#define BF_RTC_WAR_IERW(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_WAR_IERW) & BM_RTC_WAR_IERW)

/*! @brief Set the IERW field to a new value. */
#define BW_RTC_WAR_IERW(x, v) (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_IERW) = (v))
/*@}*/

/*!
 * @name Register RTC_WAR, field TTSW[8] (RW)
 *
 * After being cleared, this bit is set onlyby system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Writes to the Tamper Time Seconds Register are ignored.
 * - 1 - Writes to the Tamper Time Seconds Register complete as normal.
 */
/*@{*/
#define BP_RTC_WAR_TTSW      (8U)          /*!< Bit position for RTC_WAR_TTSW. */
#define BM_RTC_WAR_TTSW      (0x00000100U) /*!< Bit mask for RTC_WAR_TTSW. */
#define BS_RTC_WAR_TTSW      (1U)          /*!< Bit field size in bits for RTC_WAR_TTSW. */

/*! @brief Read current value of the RTC_WAR_TTSW field. */
#define BR_RTC_WAR_TTSW(x)   (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_TTSW))

/*! @brief Format value for bitfield RTC_WAR_TTSW. */
#define BF_RTC_WAR_TTSW(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_WAR_TTSW) & BM_RTC_WAR_TTSW)

/*! @brief Set the TTSW field to a new value. */
#define BW_RTC_WAR_TTSW(x, v) (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_TTSW) = (v))
/*@}*/

/*!
 * @name Register RTC_WAR, field MERW[9] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Writes to the Monotonic Enable Register are ignored.
 * - 1 - Writes to the Monotonic Enable Register complete as normal.
 */
/*@{*/
#define BP_RTC_WAR_MERW      (9U)          /*!< Bit position for RTC_WAR_MERW. */
#define BM_RTC_WAR_MERW      (0x00000200U) /*!< Bit mask for RTC_WAR_MERW. */
#define BS_RTC_WAR_MERW      (1U)          /*!< Bit field size in bits for RTC_WAR_MERW. */

/*! @brief Read current value of the RTC_WAR_MERW field. */
#define BR_RTC_WAR_MERW(x)   (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_MERW))

/*! @brief Format value for bitfield RTC_WAR_MERW. */
#define BF_RTC_WAR_MERW(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_WAR_MERW) & BM_RTC_WAR_MERW)

/*! @brief Set the MERW field to a new value. */
#define BW_RTC_WAR_MERW(x, v) (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_MERW) = (v))
/*@}*/

/*!
 * @name Register RTC_WAR, field MCLW[10] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Writes to the Monotonic Counter Low Register are ignored.
 * - 1 - Writes to the Monotonic Counter Low Register complete as normal.
 */
/*@{*/
#define BP_RTC_WAR_MCLW      (10U)         /*!< Bit position for RTC_WAR_MCLW. */
#define BM_RTC_WAR_MCLW      (0x00000400U) /*!< Bit mask for RTC_WAR_MCLW. */
#define BS_RTC_WAR_MCLW      (1U)          /*!< Bit field size in bits for RTC_WAR_MCLW. */

/*! @brief Read current value of the RTC_WAR_MCLW field. */
#define BR_RTC_WAR_MCLW(x)   (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_MCLW))

/*! @brief Format value for bitfield RTC_WAR_MCLW. */
#define BF_RTC_WAR_MCLW(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_WAR_MCLW) & BM_RTC_WAR_MCLW)

/*! @brief Set the MCLW field to a new value. */
#define BW_RTC_WAR_MCLW(x, v) (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_MCLW) = (v))
/*@}*/

/*!
 * @name Register RTC_WAR, field MCHW[11] (RW)
 *
 * After being cleared, this bit is set only by system reset. It is not affected
 * by VBAT POR or software reset.
 *
 * Values:
 * - 0 - Writes to the Monotonic Counter High Register are ignored.
 * - 1 - Writes to the Monotonic Counter High Register complete as normal.
 */
/*@{*/
#define BP_RTC_WAR_MCHW      (11U)         /*!< Bit position for RTC_WAR_MCHW. */
#define BM_RTC_WAR_MCHW      (0x00000800U) /*!< Bit mask for RTC_WAR_MCHW. */
#define BS_RTC_WAR_MCHW      (1U)          /*!< Bit field size in bits for RTC_WAR_MCHW. */

/*! @brief Read current value of the RTC_WAR_MCHW field. */
#define BR_RTC_WAR_MCHW(x)   (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_MCHW))

/*! @brief Format value for bitfield RTC_WAR_MCHW. */
#define BF_RTC_WAR_MCHW(v)   ((uint32_t)((uint32_t)(v) << BP_RTC_WAR_MCHW) & BM_RTC_WAR_MCHW)

/*! @brief Set the MCHW field to a new value. */
#define BW_RTC_WAR_MCHW(x, v) (BITBAND_ACCESS32(HW_RTC_WAR_ADDR(x), BP_RTC_WAR_MCHW) = (v))
/*@}*/

/*******************************************************************************
 * HW_RTC_RAR - RTC Read Access Register
 ******************************************************************************/

/*!
 * @brief HW_RTC_RAR - RTC Read Access Register (RW)
 *
 * Reset value: 0x0000FFFFU
 */
typedef union _hw_rtc_rar
{
    uint32_t U;
    struct _hw_rtc_rar_bitfields
    {
        uint32_t TSRR : 1;             /*!< [0] Time Seconds Register Read */
        uint32_t TPRR : 1;             /*!< [1] Time Prescaler Register Read */
        uint32_t TARR : 1;             /*!< [2] Time Alarm Register Read */
        uint32_t TCRR : 1;             /*!< [3] Time Compensation Register Read */
        uint32_t CRR : 1;              /*!< [4] Control Register Read */
        uint32_t SRR : 1;              /*!< [5] Status Register Read */
        uint32_t LRR : 1;              /*!< [6] Lock Register Read */
        uint32_t IERR : 1;             /*!< [7] Interrupt Enable Register Read */
        uint32_t TTSR : 1;             /*!< [8] Tamper Time Seconds Read */
        uint32_t MERR : 1;             /*!< [9] Monotonic Enable Register Read */
        uint32_t MCLR : 1;             /*!< [10] Monotonic Counter Low Read */
        uint32_t MCHR : 1;             /*!< [11] Monotonic Counter High Read */
        uint32_t RESERVED0 : 20;       /*!< [31:12]  */
    } B;
} hw_rtc_rar_t;

/*!
 * @name Constants and macros for entire RTC_RAR register
 */
/*@{*/
#define HW_RTC_RAR_ADDR(x)       ((uintptr_t)(x) + 0x804U)

